Тест1/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.Roistat_Сделки</registerRecords>
  <attributes>
    <name>КлиентНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.дт_СостоянияЗаказовКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСвязи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВнешний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролёр</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКонтроля</name>
    <type>
      <types>EnumRef.СтатусыКонтроляЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОписания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Канал</name>
    <type>
      <types>CatalogRef.ИсточникиОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <type>
      <types>EnumRef.ТипЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПредлагаемойЦены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоВзаимодействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прослушано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АтоматическоеСоздание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПродажи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Целевая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыОбработкиЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодстатусОбработки</name>
    <type>
      <types>EnumRef.ПодстатусыОбработкиЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработку</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>WTPanel</name>
    <type>
      <types>CatalogRef.СтатусыWT</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланРеагированияНаЗаявку</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОригинала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредлагаемаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ИндКод</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.дт_РолиВПродаже</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/CommonModules/ОбновлениеКлиентскойБазыВызовСервера/Module.bsl
&НаСервере
Процедура ОбновлениеДанныхПоЗаявкам() Экспорт

	///+ГомзМА 22.02.2023 (Задача 000002751 от 17.02.2023)
	Клиенты = Новый Запрос;
	Клиенты.Текст = 
		"ВЫБРАТЬ
		|	Клиенты.Ссылка КАК Клиент
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты";
	
	РезультатЗапросаКлиент = Клиенты.Выполнить().Выбрать();
	
	Пока РезультатЗапросаКлиент.Следующий() Цикл
		СправочникОбъект = РезультатЗапросаКлиент.Клиент.ПолучитьОбъект();
		ПолучитьПоследнююЗаявкуПоКлиенту(СправочникОбъект);
		СправочникОбъект.Записать();
	КонецЦикла;
	///-ГомзМА 22.02.2023 (Задача 000002751 от 17.02.2023)

КонецПроцедуры

&НаСервере
Процедура ПолучитьПоследнююЗаявкуПоКлиенту(СправочникОбъект)

	///+ГомзМА 22.02.2023 (Задача 000002751 от 17.02.2023)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиента.Ссылка КАК Документ,
		|	ЗаказКлиента.Дата КАК Дата,
		|	ЗаказКлиента.Номер КАК Номер,
		|	ЗаказКлиента.Состояние КАК Состояние,
		|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Клиент = &Клиент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Клиент", СправочникОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Пока РезультатЗапроса.Следующий() Цикл
			СправочникОбъект.ДатаПоследнейЗаявки 		= РезультатЗапроса.Дата;
			СправочникОбъект.НомерПоследнейЗаявки 		= РезультатЗапроса.Номер;
			СправочникОбъект.СостояниеПоследнейЗаявки 	= РезультатЗапроса.Состояние;
			СправочникОбъект.СуммаПоследнейЗаявки 		= РезультатЗапроса.СуммаДокумента;
		КонецЦикла;
	КонецЕсли;
	///-ГомзМА 22.02.2023 (Задача 000002751 от 17.02.2023)
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДатуНаСервере() Экспорт
	
	///+ГомзМА 21.12.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Клиенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Пока РезультатЗапроса.Следующий() Цикл
		ДатаПоследнегоКонтакта = ПолучитьДатуПоследнегоКонтакта(РезультатЗапроса.Ссылка);
		Если ДатаПоследнегоКонтакта <> Неопределено Тогда
			СпрОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
			Если СпрОбъект.ДатаПоследнегоКонтакта < ДатаПоследнегоКонтакта Тогда
				СпрОбъект.ДатаПоследнегоКонтакта = ДатаПоследнегоКонтакта;
			КонецЕсли;
			СпрОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	///-ГомзМА 21.12.2023
		
	/////+ГомзМА 30.03.2023 
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Клиенты.Ссылка КАК Ссылка,
	//|	Клиенты.ДатаПоследнегоКонтакта КАК ДатаПоследнегоКонтакта
	//|ПОМЕСТИТЬ ВТ_Клиент
	//|ИЗ
	//|	Справочник.Клиенты КАК Клиенты
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	МАКСИМУМ(ЗаписиЗвонков.Дата) КАК Дата,
	//|	ЗаписиЗвонков.Клиент КАК Клиент
	//|ПОМЕСТИТЬ ВТ_Звонки
	//|ИЗ
	//|	РегистрСведений.ЗаписиЗвонков КАК ЗаписиЗвонков
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаписиЗвонков.Клиент
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Клиент.Ссылка КАК Ссылка,
	//|	ВТ_Клиент.ДатаПоследнегоКонтакта КАК ДатаПоследнегоКонтакта,
	//|	ВТ_Звонки.Дата КАК Дата,
	//|	ВТ_Звонки.Клиент КАК Клиент
	//|ИЗ
	//|	ВТ_Клиент КАК ВТ_Клиент
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Звонки КАК ВТ_Звонки
	//|		ПО ВТ_Клиент.Ссылка = ВТ_Звонки.Клиент";
	//
	//
	//
	//РезультатЗапроса = Запрос.Выполнить().Выбрать();
	//
	//
	//Пока РезультатЗапроса.Следующий() Цикл
	//	
	//	СправочникОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
	//	СправочникОбъект.ДатаПоследнегоКонтакта = РезультатЗапроса.Дата;
	//	Попытка
	//		СправочникОбъект.Записать();
	//	Исключение
	//		
	//	КонецПопытки;
	//КонецЦикла;
	//
	//
	//Сообщить("Данные успешно заполнены!");
	/////-ГомзМА 30.03.2023
	
КонецПроцедуры


&НаСервере
Функция ПолучитьДатуПоследнегоКонтакта(Клиент)

	///+ГомзМА 21.12.2023
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиента.Ссылка КАК Ссылка,
		|	ЗаказКлиента.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_Заявка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Клиент.Телефон = &Телефон
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПродажаЗапчастей.Ссылка КАК Ссылка,
		|	ПродажаЗапчастей.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_Продажа
		|ИЗ
		|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
		|ГДЕ
		|	ПродажаЗапчастей.Клиент.Телефон = &Телефон
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказНаряд.Ссылка КАК Ссылка,
		|	ЗаказНаряд.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_ЗаказНаряд
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Клиент.Телефон = &Телефон
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаписиЗвонков.НомерТелефона КАК НомерТелефона,
		|	ЗаписиЗвонков.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_Звонок
		|ИЗ
		|	РегистрСведений.ЗаписиЗвонков КАК ЗаписиЗвонков
		|ГДЕ
		|	ЗаписиЗвонков.Клиент.Телефон = &Телефон
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявка.Ссылка КАК Ссылка,
		|	ВТ_Заявка.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_ДокПоКлиенту
		|ИЗ
		|	ВТ_Заявка КАК ВТ_Заявка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Продажа.Ссылка,
		|	ВТ_Продажа.Дата
		|ИЗ
		|	ВТ_Продажа КАК ВТ_Продажа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗаказНаряд.Ссылка,
		|	ВТ_ЗаказНаряд.Дата
		|ИЗ
		|	ВТ_ЗаказНаряд КАК ВТ_ЗаказНаряд
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Звонок.НомерТелефона,
		|	ВТ_Звонок.Дата
		|ИЗ
		|	ВТ_Звонок КАК ВТ_Звонок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_ДокПоКлиенту.Дата КАК Дата
		|ИЗ
		|	ВТ_ДокПоКлиенту КАК ВТ_ДокПоКлиенту
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Телефон", Клиент.Телефон);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		РезультатЗапроса.Следующий();
		Результат = РезультатЗапроса.Дата;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	///-ГомзМА 21.12.2023

КонецФункции // ПолучитьДатуПоследнегоКонтакта(Клиент)
